NextFOAM-2506/tutorials/incompressible/adjointOptimisationFoam/topologyOptimisation/monoFluidAero/laminar/3DBox/losses-mass-uniformity-SQP/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

vertices        
(
    (0    0    0)    //0
    (0.2  0    0)    //1
    (0.2  0.1  0)    //2
    (0.2  0.2  0)    //3
    (0.1  0.2  0)    //4
    (0    0.1  0)    //5
    (0    0    0.1)  //6
    (0.2  0    0.1)  //7
    (0.2  0.1  0.1)  //8
    (0.2  0.2  0.1)  //9
    (0.1  0.2  0.1)  //10
    (0    0.1  0.1)  //11
);

blocks          
(
    hex (0 1 2 5 6 7 8 11)  (76 38 38) simpleGrading (1 1 1)
    hex (5 2 3 4 11 8 9 10) (76 38 38) simpleGrading (1 1 1)
);

edges           
(
);

patches         
(
    wall fixedWalls
    (
        (0 1 2 5)
        (7 1 2 8)
        (6 0 5 11)
        (0 1 7 6)
        (5 2 3 4)
        (8 2 3 9)
        (11 5 4 10)
        (4 3 9 10)    
    )
    symmetry symmetry
    (
        (6 7 8 11)
        (11 8 9 10)
    )
);

mergePatchPairs 
(
);

// ************************************************************************* //
